# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4] Output: 6

list = [1, 2, -1, 4, 4, 6, 8, 8]
print(list)
print(len(list))
print(len(set(list)))